app/views/v2/qbe/SendPolicyInfo.xml.erb

<soapenv:Envelope 
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:proc="<%= Rails.application.credentials.qbe[:uri][ENV['RAILS_ENV'].to_sym] %>">
  <soapenv:Header/>
  <soapenv:Body>
    <proc:processRenterRequest>
      <xmldata>
        <![CDATA[
          <?xml version="1.0" encoding="UTF-8"?>
          <ACORD>
            <SignonRq>
              <ClientDt><%= Time.current.strftime("%Y-%m-%dT%H:%M:%S") %></ClientDt>
              <ClientApp>
                <Org>Get Covered, LLC.</Org>
                <Name><%= request[:heading][:program][:ClientName] %></Name>
                <Version><%= Rails.application.credentials.version %></Version>
              </ClientApp>
              <ProxyClient>
                <Name><%= request[:heading][:program][:ClientName] %></Name>
              </ProxyClient>
            </SignonRq>
            <InsuranceSvcRq>
              <RenterPolicyQuoteInqRq>
                <TransactionType>Add</TransactionType>
                <Producer>
                  <ProducerInfo>
                    <ContractNumber><%= request[:heading][:program][:ClientName] %></ContractNumber>
                  </ProducerInfo>
                </Producer>
                <PersPolicy>
                  <PolicyNumber />
                  <CompanyProductCd>RENT</CompanyProductCd>
                  <LOBCd>TENAN</LOBCd>
                  <NAICCd>37257</NAICCd>
                  <ControllingStateProvCd><%= request[:data][:address].state %></ControllingStateProvCd>
                  
                  <ContractTerm>
                    <EffectiveDt><%= request[:data][:application].effective_date.strftime('%m/%d/%Y') %></EffectiveDt>
                    <ExpirationDt><%= request[:data][:application].expiration_date.strftime('%m/%d/%Y') %></ExpirationDt>
                    <DurationPeriod>
                      <NumUnits>12</NumUnits>
                      <UnitMeasurementCd>MON</UnitMeasurementCd>
                    </DurationPeriod>
                  </ContractTerm>
                  
                  <QBE_BillingSystem>Q</QBE_BillingSystem>
                  
                  <CurrentTermAmt>
                    <Amt><%= '%.2f' % ((request[:data][:quote].carrier_payment_data['policy_fee'] + request[:data][:premium].total_premium + request[:data][:premium].total_tax).to_d / 100) %></Amt>
                  </CurrentTermAmt>
                  
                  <PayorCd>PD</PayorCd>
                  
                  <PaymentOption id="0">
                  	
                    <PaymentPlanCd><%= request[:data][:billing_strategy].carrier_code %></PaymentPlanCd>
                    
                    <DayMonthDue><%= request[:data][:application].effective_date.strftime('%d') %></DayMonthDue>
                    
                    <CollectedByAgentAmt>
                      <Amt>0.00</Amt>
                    </CollectedByAgentAmt>
                    
                    <MethodPaymentCd>IN</MethodPaymentCd>

                    <ElectronicFundsTransfer>
                      <FromAcct>
                        <PayrollDeductionInfo>
                          <EmployeeId><%= request[:data][:quote].external_reference %></EmployeeId>
                        </PayrollDeductionInfo>
                      </FromAcct>
                    </ElectronicFundsTransfer> 
                  </PaymentOption>
                  <% if request[:data][:account] %>
                  <AdditionalInterest>
                    <GeneralPartyInfo>
                      <NameInfo>
                        <CommlName>
                          <CommercialName><%= request[:data][:account].title %></CommercialName>
                        </CommlName>
                      </NameInfo>
                      <Addr>
                        <Addr1><%= request[:data][:account].primary_address().combined_street_address() %></Addr1>
                        <% if request[:data][:account].primary_address().street_two.nil? %>
                        <Addr2 />
                        <% else %>
                        <Addr2><%= request[:data][:account].primary_address().street_two %></Addr2>
                        <% end %>
                        <City><%= request[:data][:account].primary_address().city %></City>
                        <StateProvCd><%= request[:data][:account].primary_address().state %></StateProvCd>
                        <PostalCode><%= request[:data][:account].primary_address().combined_zip_code() %></PostalCode>
                      </Addr>
                    </GeneralPartyInfo>
                    <AdditionalInterestInfo>
                      <NatureInterestCd>PM</NatureInterestCd>
                    </AdditionalInterestInfo>
                  </AdditionalInterest>
                  <% elsif !request[:data][:pm_info].blank? %>
                  <AdditionalInterest>
                    <GeneralPartyInfo>
                      <NameInfo><% if request[:data][:pm_info]['entity_type'] == 'company' %>
                        <CommlName>
                          <CommercialName><%= request[:data][:pm_info]['company_name'] %></CommercialName>
                        </CommlName><% else %>
                        <CommlName>
                          <CommercialName><%= ['first_name', 'middle_name', 'last_name'].map{|prop| request[:data][:pm_info][prop]&.strip }.select{|v| !v.blank? }.join(" ") %></CommercialName>
                        </CommlName><% end %>
                      </NameInfo>
                      <Addr>
                        <Addr1><%= request[:data][:pm_info]['addr1'] %></Addr1>
                        <% if request[:data][:pm_info]['addr2'].blank? %>
                        <Addr2 />
                        <% else %>
                        <Addr2><%= request[:data][:pm_info]['addr2'] %></Addr2>
                        <% end %>
                        <City><%= request[:data][:pm_info]['city'] %></City>
                        <StateProvCd><%= request[:data][:pm_info]['state']&.upcase %></StateProvCd>
                        <PostalCode><%= request[:data][:pm_info]['zip'] %></PostalCode>
                      </Addr>
                    </GeneralPartyInfo>
                    <AdditionalInterestInfo>
                      <NatureInterestCd>PM</NatureInterestCd>
                    </AdditionalInterestInfo>
                  </AdditionalInterest>
                  <% end %>
                  <% unless request[:data][:users].nil? %>
                  <% request[:data][:users].each do |policy_user| %>
                  <% if policy_user.spouse == false %>
                  <AdditionalInterest>
                    <GeneralPartyInfo>
                      <NameInfo>
                        <CommlName>
                          <CommercialName><%= policy_user.user.profile.full_name %></CommercialName>
                        </CommlName>
                      </NameInfo>
                      <Addr>
                        <Addr1><%= request[:data][:address].combined_street_address() %></Addr1><% unless request[:data][:unit].title.blank? %>
                        <Addr2><%= request[:data][:unit].title.gsub(/[^0-9,.]/, "") %></Addr2><% end %>
                        <City><%= request[:data][:address].city %></City>
                        <StateProvCd><%= request[:data][:address].state %></StateProvCd>
                        <PostalCode><%= request[:data][:address].zip_code %></PostalCode>
                      </Addr>                      
                    </GeneralPartyInfo>
                    <AdditionalInterestInfo>
                      <NatureInterestCd>ADDIN</NatureInterestCd>
                    </AdditionalInterestInfo>
                  </AdditionalInterest>                 
                  <% end %>
                  <% end %>
                  <% end %>
                  
                  <QBE_BusinessSource>NP</QBE_BusinessSource>
                  <QBE_BusinessType><%= request[:data][:carrier_profile].traits["pref_facility"] %></QBE_BusinessType>
                  <QBE_MDU_CommName><%= request[:data][:community].title %></QBE_MDU_CommName>
                  <QBE_MDU_CommID><%= request[:data][:carrier_profile].external_carrier_id %></QBE_MDU_CommID>
                  <% if request[:data][:prof_managed] == 1 %>
                  <QBE_MDU_ProfManagedDt><%= request[:data][:prof_managed_year] %></QBE_MDU_ProfManagedDt>
                  <% end %>
                </PersPolicy>
                
                <InsuredOrPrincipal>
                  <ItemIdInfo>
                    <OtherIdentifier>
                      <OtherIdTypeCd>CustProfileId</OtherIdTypeCd>
                      <OtherId><%= request[:data][:user].user.qbe_id %></OtherId>
                    </OtherIdentifier>
                  </ItemIdInfo>
                  <GeneralPartyInfo>
                    <NameInfo>
                      <PersonName>
                        <Surname><%= request[:data][:user].user.profile.last_name %></Surname>
                        <GivenName><%= request[:data][:user].user.profile.first_name %></GivenName>
                        <% unless request[:data][:user].user.profile.middle_name.nil? %>
                        <OtherGivenName><%= request[:data][:user].user.profile.middle_name %></OtherGivenName>
                        <% end %>
                      </PersonName>
                      <LegalEntityCd>IN</LegalEntityCd>
                    </NameInfo>
                    <Addr>
                      <AddrTypeCd>InsuredsAddress</AddrTypeCd>
                      <Addr1><%= request[:data][:address].combined_street_address() %></Addr1><% unless request[:data][:unit].title.blank? %>
                      <Addr2><%= request[:data][:unit].title.gsub(/[^0-9,.]/, "") %></Addr2><% end %>
                      <City><%= request[:data][:address].city %></City>
                      <StateProvCd><%= request[:data][:address].state %></StateProvCd>
                      <PostalCode><%= request[:data][:address].zip_code %></PostalCode>
                    </Addr>
                    <Communications>
                      <PhoneInfo>
                        <PhoneNumber><%= request[:data][:user].user.profile.contact_phone %></PhoneNumber>
                      </PhoneInfo>
                      <EmailInfo>
                        <EmailAddr><%= request[:data][:user].user.email %></EmailAddr>
                      </EmailInfo>
                    </Communications>
                  </GeneralPartyInfo>
                  <InsuredOrPrincipalInfo>
                    <InsuredOrPrincipalRoleCd>Insured</InsuredOrPrincipalRoleCd>
                  </InsuredOrPrincipalInfo>
                </InsuredOrPrincipal>
                  
                <% unless request[:data][:users].nil? %>
                <% request[:data][:users].each do |policy_user| %>
                <% if policy_user.spouse == true %>
                <InsuredOrPrincipal>
                  <GeneralPartyInfo>
                    <NameInfo>
                      <PersonName>
                        <Surname><%= policy_user.user.profile.last_name %></Surname>
                        <GivenName><%= policy_user.user.profile.first_name %></GivenName>
                        <% unless policy_user.user.profile.middle_name.nil? %>
                        <OtherGivenName><%= policy_user.user.profile.middle_name %></OtherGivenName>
                        <% end %>
                      </PersonName>
                    </NameInfo>
                  </GeneralPartyInfo>
                  <InsuredOrPrincipalInfo>
                    <InsuredOrPrincipalRoleCd>Coinsured</InsuredOrPrincipalRoleCd>
                    <PersonInfo>
                      <TitleRelationshipCd>SP</TitleRelationshipCd>
                    </PersonInfo> 
                  </InsuredOrPrincipalInfo>
                </InsuredOrPrincipal>                   
                <% end %>
                <% end %>
                <% end %>
                
                <Location id="0">
                  <Addr>
                    <AddrTypeCd>InsuredsAddress</AddrTypeCd>
                    <Addr1><%= request[:data][:address].combined_street_address() %></Addr1><% unless request[:data][:unit].title.blank? %>
                    <Addr2><%= request[:data][:unit].title.gsub(/[^0-9,.]/, "") %></Addr2><% end %>
                    <City><%= request[:data][:address].city %></City>
                    <StateProvCd><%= request[:data][:address].state %></StateProvCd>
                    <PostalCode><%= request[:data][:address].zip_code %></PostalCode>
                    <QBE_UnitID><%= request[:data][:unit].carrier_profile(1).external_carrier_id %></QBE_UnitID>
                    <QBE_InsideCityLimitInd><%= request[:data][:city_limit] == 1 ? "Y" : "N" %></QBE_InsideCityLimitInd>
                  </Addr>
                  <TaxCodeInfo>
                    <TaxCd><%= request[:data][:county] || request[:data][:address].county %></TaxCd>
                    <TaxTypeCd>CountyProp</TaxTypeCd>
                  </TaxCodeInfo>
                </Location>
                
                <HomeLineBusiness>
                  <Dwell LocationRef="0">
                    <PolicyTypeCd>04</PolicyTypeCd>
                    <Construction>
                      <% if request[:data][:address].state == 'FL' %>
                      <ConstructionCd><%= request[:data][:carrier_profile].traits["construction_type"] %></ConstructionCd>
                      <BldgCodeEffectivenessGradeCd>03</BldgCodeEffectivenessGradeCd>
                      <% end %>
                      <YearBuilt><%= request[:data][:age_of_facility] %></YearBuilt>
                    </Construction>
                    <DwellOccupancy>
                      <OccupancyTypeCd><%= request[:data][:carrier_profile].traits["occupancy_type"] %></OccupancyTypeCd>
                    </DwellOccupancy>
                    <BldgProtection>
                      <NumFireDivisions><%= request[:data][:units_on_site] %></NumFireDivisions>
                      <% if request[:data][:address].state == 'FL' %>
                      <FireProtectionClassCd><%= request[:data][:carrier_profile].traits["ppc"] %></FireProtectionClassCd>
                      <OtherProtectionDesc><%= request[:data][:carrier_profile].traits["protection_device_cd"] %></OtherProtectionDesc>
                      <% end %>    
                    </BldgProtection>a
                    
                    <Coverage>
                      <CoverageCd>DED</CoverageCd>
                      <Deductible>
                        <FormatInteger><%= ((request[:data][:coverage_selections]['all_peril']&.[]('selection')&.[]('value') || 0).to_d / 100).to_i %></FormatInteger>
                      </Deductible>
                    </Coverage>
                    
                    <Coverage>
                      <CoverageCd>PP</CoverageCd>
                      <Limit>
                        <FormatInteger><%= ((request[:data][:coverage_selections]['coverage_c']&.[]('selection')&.[]('value') || 0).to_d / 100).to_i %></FormatInteger>
                      </Limit>
                    </Coverage>
                    
                    <Coverage>
                      <CoverageCd>LOU</CoverageCd>
                      <Limit>
                        <FormatInteger><%= ((request[:data][:coverage_selections]['coverage_c']&.[]('selection')&.[]('value') || 0).to_d * (request[:data][:address].state == 'CT' ? 0.3 : 0.2) / 100).to_i %></FormatInteger>
                      </Limit>
                    </Coverage>
                    
                    <% request[:data][:coverage_selections].select{|k,cs| cs['category'] == 'option' && ['pet_damage','water_backup','bedbug','equip','earthquake_coverage'].include?(k) }.each do |subschedule, covopt| %>
                    <Coverage>
                      <CoverageCd><%= { 'pet_damage' => 'QBE_PetDam', 'water_backup' => 'SEWER_Sump', 'bedbug' => 'BEDBUG', 'equip' => 'EQUIP', 'earthquake_coverage' => 'ERQK' }[subschedule] %></CoverageCd>
                      <Limit>
                        <FormatInteger><%= ((request[:data][:coverage_selections][subschedule]&.[]('selection') == true ? 0 : request[:data][:coverage_selections][subschedule]&.[]('selection')&.[]('value') || 0).to_d / 100).to_i %></FormatInteger>
                      </Limit>
                    </Coverage>
                    <% end %>
                    
                    <% if request[:data][:address].state == 'FL' %>
                    <Coverage>
                      <CoverageCd>QBE_HURRD</CoverageCd>
                      <Deductible>
                        <FormatInteger><%= ((request[:data][:coverage_selections]['hurricane']&.[]('selection')&.[]('value') || 0).to_d / 100).to_i %></FormatInteger>
                      </Deductible>
                    </Coverage>                    
                    <% end %>
                    
                    <QuestionAnswer>
                      <QuestionCd>QBEPL00040</QuestionCd>
                      <YesNoCd><%= request[:data][:gated_community] == 1 ? "Y" : "N" %></YesNoCd>
                    </QuestionAnswer>
                    
                    <QBE_WH_Ded>1000</QBE_WH_Ded>
                    
                  </Dwell>
                  <Coverage>
                    <CoverageCd>PL</CoverageCd>
                    <Limit>
                      <FormatInteger><%= ((request[:data][:coverage_selections]['liability']&.[]('selection')&.[]('value') || 0).to_d / 100).to_i %></FormatInteger>
                    </Limit>
                  </Coverage>
                  <Coverage>
                    <CoverageCd>MEDPM</CoverageCd>
                    <Limit>
                      <FormatInteger><%= ((request[:data][:coverage_selections]['medical']&.[]('selection')&.[]('value') || 0).to_d / 100).to_i %></FormatInteger>
                    </Limit>
                  </Coverage>
                </HomeLineBusiness>
              </RenterPolicyQuoteInqRq>
            </InsuranceSvcRq>
          </ACORD>
        ]]>
      </xmldata>
    </proc:processRenterRequest>
  </soapenv:Body>
</soapenv:Envelope>
